package com.mostafadev.quizapp

object Constants {
    fun getQuestions():ArrayList<Question>{
        val questionList=ArrayList<Question>()
        val q1=Question(
            1,
            "كم كان عمر النبي محمد صلى الله عليه وسلم عندما توفيت أمه؟",
            "3 سنوات",
            "4 سنوات",
            "5 سنوات",
            "6 سنوات",
            3
        )
        questionList.add(q1)
        val q2=Question(2,
            "ما هي أطول سورة في القرآن الكريم؟",
            " سورة البقرة",
            " سورة آل عمران",
            " سورة النساء",
            " سورة المائدة",
            1
        )
        questionList.add(q2)
        val q3=Question(3,
            "الشهر الثالث في التقويم الهجري؟",
            "شعبان",
            "ربيع الأول",
            "جمادي الآخرة",
            "ذو القعده",
            2)
        questionList.add(q3)
        val q4=Question(4,
            "ما السورة التي ختمت باسم وقت من أوقات الصلاة؟",
            " سورة القدر",
            " سورة البلد",
            " سورة الأعلى",
            " سورة الفجر",
            1

        )
        questionList.add(q4)
        val q5=Question(5,
            "كم عدد التكبيرات في الركعة الأولى في صلاة العيد؟",
            " ستة",
            " سبعة",
            " تسعة",
            " خمسة",
            2)
        questionList.add(q5)
        val q6=Question(6,
            "في أي جهة يقع باب الكعبة المشرفة؟",
            " في الجهة الغربية من الكعبة",
            " في الجهة الجنوبية من الكعبة",
            " في الجهة الشمالية من الكعبة",
            " في الجهة الشرقية من الكعبة",
            4
        )
        questionList.add(q6)
        val q7=Question(7,
            "كم عدد مصارف الزكاة؟",
            " ثمانية",
            " خمسة",
            " سبعة",
            " تسعة",
            1
        )
        questionList.add(q7)
        val q8=Question(8,
            "كم مرة ذكرت السيدة مريم في القرآن الكريم؟",
            " 43 مرة",
            " 55 مرة",
            " 42 مرة",
            " 34 مرة",
            4)
        questionList.add(q8)
        val q9=Question(9,
            "قال تعالى في سورة العاديات: ( فالمغيرات صبحا (3)) ماالمقصود بالمغيرات؟",
            " الرياح الشديدة",
            " الابل",
            " الملائكة السابحين",
            " الخيل",
            4)
        questionList.add(q9)
        val q10=Question(10,
            "ما هي أعظم آية في القرآن الكريم؟",
            " آية الكرسي",
            " آخر آية من سورة الكهف",
            " آخر آية من سورة البقرة",
            " أول آية من سورة البقرة",
            1
        )
        questionList.add(q10)

    return questionList
    }
}